{
	"id": 8,
	"topic": "Best Time to Buy and Sell Stock II",
	"code": "// Find the maximum profit with multiple transactions\nvar maxProfit = function(prices) {\n let maxProfit = 0;\n\n for (let i = 1; i < prices.length; i++) {\n // If the price today is higher than the price yesterday,\n // it means we can make a profit by selling the stock.\n if (prices[i] > prices[i - 1]) {\n // Add the difference between today's price and yesterday's price to maxProfit\n maxProfit += prices[i] - prices[i - 1];\n }\n }\n\n // Return the total profit achieved from all profitable transactions\n return maxProfit;\n};\n\n// Example 1:\nconsole.log(maxProfit([7,1,5,3,6,4])); // Output: 7\n// Explanation: Buy on day 2 (price = 1) and sell on day 3 (price = 5), profit = 5 - 1 = 4.\n// Then buy on day 4 (price = 3) and sell on day 5 (price = 6), profit = 6 - 3 = 3.\n// Total profit = 4 + 3 = 7.\n\n// Example 2:\nconsole.log(maxProfit([1,2,3,4,5])); // Output: 4\n// Explanation: Buy on day 1 (price = 1) and sell on day 5 (price = 5), profit = 5 - 1 = 4.\n// Total profit = 4.\n\n// Example 3:\nconsole.log(maxProfit([7,6,4,3,1])); // Output: 0\n// Explanation: No profitable opportunities since prices keep decreasing.\n// Total profit = 0.\n",
	"explanation": "Explanation:\n\n- We are given an array 'prices' where each element represents the price of a stock on a given day.\n- The goal is to maximize profit by buying and selling the stock at the right times.\n- The key observation is that you can make a profit if the stock price increases from one day to the next.\n- On each day, if the price is higher than the previous day's price, we \"buy\" on the previous day and \"sell\" on the current day. The profit from this transaction is the difference between the two prices.\n- We repeat this for all days, adding the profits from each transaction, to get the total maximum profit.\n- The approach runs in linear time O(n), where n is the number of days in the 'prices' array.",
	"category": "Array / String"
}
